app/views/contamination_reports/_form.html.erb

    <%= f.label :survivor_id %><br>
    <%= f.collection_select(:survivor_id, Survivor.all, :id, :name, include_blank: true) %>
---
SELECT "survivors".* FROM "survivors"