app/controllers/contamination_reports_controller.rb

SELECT "contamination_reports".* FROM "contamination_reports"
---
  def index
    @contamination_reports = ContaminationReport.all

INSERT INTO "contamination_reports" ("survivor_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["survivor_id", 1], ["created_at", "2018-01-24 04:34:26.046099"], ["updated_at", "2018-01-24 04:34:26.046099"]]
---
  def create
    @contamination_report = ContaminationReport.new(contamination_report_params)

    respond_to do |format|
      if @contamination_report.save

DELETE FROM "contamination_reports" WHERE "contamination_reports"."id" = ?  [["id", 1]]
---
  def destroy
    @contamination_report.destroy

SELECT  "contamination_reports".* FROM "contamination_reports" WHERE "contamination_reports"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_contamination_report
      @contamination_report = ContaminationReport.find(params[:id])