app/controllers/inventories_controller.rb

  def index
    @inventories = Inventory.all
---
SELECT "inventories".* FROM "inventories"

  def create

    @inventory = Inventory.new(inventory_params)

    respond_to do |format|
      if @inventory.save
---
INSERT INTO "inventories" ("water", "food", "medication", "ammunition", "survivor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["water", 1], ["food", 1], ["medication", 2], ["ammunition", 1], ["survivor_id", 1], ["created_at", "2018-01-23 06:05:54.512225"], ["updated_at", "2018-01-23 06:05:54.512225"]]

  def update
    respond_to do |format|
      if @inventory.update(inventory_params)
---
UPDATE "inventories" SET "water" = ?, "updated_at" = ? WHERE "inventories"."id" = ?  [["water", 15], ["updated_at", "2018-01-25 01:53:14.110195"], ["id", 6]]

  def destroy
    @inventory.destroy
---
DELETE FROM "inventories" WHERE "inventories"."id" = ?  [["id", 1]]

    def set_inventory
      @inventory = Inventory.find(params[:id])
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT 1  [["id", 6]]

    def set_survivor
      @survivors = Survivor.all
---
SELECT "survivors".* FROM "survivors"