app/controllers/survivors_controller.rb

SELECT "survivors".* FROM "survivors"
---
  def index
    @survivors = Survivor.all

INSERT INTO "survivors" ("name", "age", "gender", "lastLatitude", "lastLongitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Adriele"], ["age", 23], ["gender", "F"], ["lastLatitude", 23.4], ["lastLongitude", 13.0], ["created_at", "2018-01-23 05:51:50.177714"], ["updated_at", "2018-01-23 05:51:50.177714"]]
---
  def create
    @survivor = Survivor.new(survivor_params)

    respond_to do |format|
      if @survivor.save

UPDATE "survivors" SET "name" = ?, "age" = ?, "gender" = ?, "updated_at" = ? WHERE "survivors"."id" = ?  [["name", "Negan"], ["age", 47], ["gender", "M"], ["updated_at", "2018-01-25 15:13:37.348498"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @survivor.update(survivor_params)

DELETE FROM "survivors" WHERE "survivors"."id" = ?  [["id", 5]]
---
  def destroy
    @survivor.destroy

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_survivor
      @survivor = Survivor.find(params[:id])